[questions Pandas](http://localhost:8888/notebooks/Desktop/Data%20Science/SDA/SDA%20szkolenie/Przetwarzanie_zbior%C3%B3w_danych/zadaniami_z_Pandasa/Pandas.ipynb)

[Zadania_przetwarzanie_danych.pdf](http://localhost:8888/files/Desktop/Data%20Science/SDA/SDA%20szkolenie/Przetwarzanie_zbior%C3%B3w_danych/Sesj%C4%99%20Samodzieln%C4%85/Zadania_przetwarzanie_danych.pdf)

# import

In [1]:
import pandas as pd
import numpy as np

# Porównywanie pd.Series

Utwórz dwa obiekty typu `pd.Series`, zawierające 100 wartości 0 lub 1. Wykorzystaj w tym celu generator liczb losowych z biblioteki NumPy [np.random.randint](https://docs.scipy.org/doc/numpy-1.15.1/reference/generated/numpy.random.randint.html#numpy-random-randint).

Następnie wyświetl wszystkie indeksy, na których wartości w obu Series się zgadzają.

In [35]:
n = 100
df_1 = pd.Series( np.random.randint(low= 2, size = n))
df_2 = pd.Series( np.random.randint(low= 2, size = n))
df_1[df_1 == df_2].index

Index([ 1,  2,  3,  8, 11, 14, 15, 19, 21, 22, 24, 25, 27, 31, 33, 37, 40, 41,
       43, 44, 45, 46, 49, 50, 52, 54, 55, 56, 57, 60, 61, 65, 66, 72, 73, 76,
       79, 80, 82, 87, 88, 89, 90, 91, 93, 94],
      dtype='int64')

# Zbiór chipotle - kto zapłacił najwięcej?

Wczytaj zbiór [chipotle]( https://github.com/matzim95/ML-datasets ) i dodaj kolumne `price_dollars`, zawierającą cenę w dolarach. Następnie sprawdź, które z zamówień opiewało na najwyższą kwotę (wykorzystaj w tym celu grupowanie i wybraną agregację). Podaj jego indeks (`order_id`) oraz wartość zamówienia.

In [61]:
df = pd.read_html("https://github.com/matzim95/ML-datasets/blob/master/chipotle.tsv",
                 encoding= "utf-8")[0].drop("Unnamed: 0", axis=1)
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [67]:
# dodaj kolumne price_dollars, zawierającą cenę w dolarach
df["price_dollars"] = df.item_price.apply(lambda L: L[1:]).astype("float")

In [96]:
# które z zamówień opiewało na najwyższą kwotę.
# Podaj jego indeks (order_id) oraz wartość zamówienia.
sumeri_prince = df.groupby("order_id", as_index= False).agg({"price_dollars":"sum"})\
                                       .sort_values("price_dollars", ascending= False)

sumeri_prince.iloc[:1]

     order_id  price_dollars
925       926         205.25

#  Łączenie DataFrames

Wczytaj zbiory [danych]((https://github.com/matzim95/ML-datasets).) `rating.csv` oraz `parking.csv`. Spróbuj połączyć je wykorzystując metodę `merge`. Pamiętaj o odpowiedniej nazwie kol

In [97]:
rating = pd.read_html("https://github.com/matzim95/ML-datasets/blob/master/rating.csv" ,
                 encoding= "utf-8")[0].drop("Unnamed: 0", axis=1)

parking = pd.read_html("https://github.com/matzim95/ML-datasets/blob/master/parking.csv" ,
                 encoding= "utf-8")[0].drop("Unnamed: 0", axis=1)

  userID  placeID  rating  food_rating  service_rating
0  U1077   135085       2            2               2
1  U1077   135038       2            2               1
2  U1077   132825       2            2               2
3  U1077   135060       1            2               2
4  U1068   135104       1            1               2

In [99]:
rating.head()

  userID  placeID  rating  food_rating  service_rating
0  U1077   135085       2            2               2
1  U1077   135038       2            2               1
2  U1077   132825       2            2               2
3  U1077   135060       1            2               2
4  U1068   135104       1            1               2

In [98]:
parking.head()

   placeID parking_lot
0   135111      public
1   135110        none
2   135109        none
3   135108        none
4   135107        none

In [101]:
data = rating.merge(parking, how= 'left' , on= "placeID" )
data.head()

  userID  placeID  rating  food_rating  service_rating parking_lot
0  U1077   135085       2            2               2      public
1  U1077   135038       2            2               1        none
2  U1077   132825       2            2               2        none
3  U1077   135060       1            2               2        none
4  U1068   135104       1            1               2         yes

# Zadania - dzień 2:
Część zadań pojawia się wcześniej na zajęciach z trenerem. Jednak ich wykonanie
jest zarezerwowane dla osób, które skończyły wcześniej aniżeli reszta grupy.
Prezentują się następująco:
Do bazy danych car_rental:
1. *Dodaj autoinkrementację dla kluczy.
2. *Zaktualizuj tabelę bookings o dwa klucze obce, które posiada.
3. *Zastąp dane wybranego klienta swoimi danymi.
4. *W związku z RODO - usuń swoje dane.
5. *Dodaj 2 nowych klientów.
6. *Wypisz wszystkie rezerwacje, których koszt całkowity znajduje się w
przedziale 1000-2555.
7. *Wypisz id wszystkich klientów, których nazwisko zaczyna się na literę 'N'
oraz imię kończy się na litery 'ej'.
8. *Wypisz liczbę wypożyczonych samochodów, dla których dzienny koszt
wypożyczenia jest większy lub równy 300, grupując samochody po mocy
silnika, sortując od najmniejszej.
9. *Wypisz sumę kosztów wszystkich rezerwacji, które zostały zrealizowane w
okresie 14-18.07.2020.
10. *Wypisz:
a. średnią liczbę pieniędzy wydanych przez każdego klienta -
nazewnictwo kolumny: Srednia_wartosc_rezerwacji
b. liczbę wypożyczonych samochodów dla każdego klienta,
uwzględniając tylko tych klientów, którzy wypożyczyli co najmniej dwa
samochody - nazewnictwo kolumny:
Liczba_wypozyczonych_samochodow
c. imię i nazwisko klienta - nazewnictwo kolumn: Imie, Nazwisko
d. sortując po największej liczbie wypożyczonych samochodów.
Wszystko jednym zapytaniem.
Dodatkowo zadania, których nie było na zajęciach:
11.Za pomocą odpowiedniej komendy otrzymaj informacje:
a. Który samochód jest najczęściej wypożyczany.
b. Który samochód przynosi najwięcej pieniędzy.
c. Średnia moc samochodów w wypożyczalni.
d. Które samochody przynoszą więcej pieniędzy, te wyprodukowane
przed 2015 rokiem, czy te po.
e. Ile samochodów zostało wypożyczonych po '2020-07-15', a ile przed
i za jaką łączną kwotę.

# Zadania - dzień 3:
1. Połącz się z serwerem mysql, ustawiając bazę cinematic jako bazę
główną/domyślną. Stwórz definicję tabeli, korzystając z SQLAlchemy:
a. Directors(klasa) - tabela directors: director_id(PK), name, surname,
rating
b. Movies(klasa) - tabela movies: movie_id(PK), title, year, category,
director_id, rating

2. Stwórz sesję, którą będziemy wykorzystywać do wykonywania zapytań.

3. Uzupełnij danymi tabele directors oraz movies, korzystając ze stworzonej
sesji. Dane:
a. directors = [ {'name': 'Frank', 'surname': 'Darabont', 'rating': 7}, {'name':
'Francis Ford', 'surname': 'Coppola', 'rating': 8}, {'name': 'Quentin',
'surname': 'Tarantino', 'rating': 10}, {'name': 'Christopher', 'surname':
'Nolan', 'rating': 9}, {'name': 'David', 'surname': 'Fincher', 'rating': 7}]

b. movies = [ {'title': 'The Shawshank Redemption', 'year': 1994,
'category': 'Drama', 'director_id': 1, 'rating': 8}, {'title': 'The Green Mile',
'year': 1999, 'category': 'Drama', 'director_id': 1, 'rating': 6}, {'title': 'The
Godfather', 'year': 1972, 'category': 'Crime', 'director_id': 2, 'rating': 7},
{'title': 'The Godfather III', 'year': 1990, 'category': 'Crime', 'director_id':
2, 'rating': 6}, {'title': 'Pulp Fiction', 'year': 1994, 'category': 'Crime',
'director_id': 3, 'rating': 9}, {'title': 'Inglourious Basterds', 'year': 2009,
'category': 'War', 'director_id': 3, 'rating': 8}, {'title': 'The Dark Knight',
'year': 2008, 'category': 'Action', 'director_id': 4, 'rating': 9}, {'title':
'Interstellar', 'year': 2014, 'category': 'Sci-fi', 'director_id': 4, 'rating': 8},
{'title': 'The Prestige', 'year': 2006, 'category': 'Drama', 'director_id': 4,
'rating': 10}, {'title': 'Fight Club', 'year': 1999, 'category': 'Drama',
'director_id': 5, 'rating': 7}, {'title': 'Zodiac', 'year': 2007, 'category':
'Crime', 'director_id': 5, 'rating': 5}, {'title': 'Seven', 'year': 1995,
'category': 'Drama', 'director_id': 5, 'rating': 8}, {'title': 'Alien 3', 'year':
1992, 'category': 'Horror', 'director_id': 5, 'rating': 5}]

4. Wypisz wszystkie filmy z kategorii Drama.
5. Wypisz tytuły filmów z kategorii Crime, które zostały wyprodukowane po roku
1994.
6. Wypisz kategorie wszystkich filmów oraz ich ranking dla filmów, które zostały
wyprodukowane w latach 2000-2010 oraz których ranking jest większy niż 7,
sortując po rankingu.
7. Wypisz nazwiska wszystkich reżyserów, których ranking jest większy bądź
równy 6, a ich imię zaczyna się na literę 'D' lub kończy się na literę 'n'.
8. Zbadaj tabele za pomocą pandas profiling.